34-cross-site-scripting-lecture/xss-backend/app/controllers/cookies_controller.rb

SELECT "cookies".* FROM "cookies"
---
  def index
    @cookies = Cookie.all

INSERT INTO "cookies" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "PHPSESSID=ia29cavol3tqufcd6shajr0fnh"], ["created_at", "2020-03-21 22:08:22.160633"], ["updated_at", "2020-03-21 22:08:22.160633"]]
---
  def create
    @cooky = Cookie.new(cooky_params)

    if @cooky.save