29-rails-api-intro/backend/app/controllers/animals_controller.rb

SELECT "animals".* FROM "animals"
---
	def index
		# Should return JSON data with all animals
		animals = Animal.all

SELECT "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		# Should return JSON data with one single animal
		animal = Animal.find(params[:id])

INSERT INTO "animals" ("name", "gender", "species_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Bob"], ["gender", "unknown"], ["species_id", 2], ["created_at", "2020-02-05 22:29:14.922226"], ["updated_at", "2020-02-05 22:29:14.922226"]]
INSERT INTO "species" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test"], ["created_at", "2020-03-18 18:31:20.584899"], ["updated_at", "2020-03-18 18:31:20.584899"]]
SELECT "species".* FROM "species" WHERE "species"."name" = ? LIMIT ?  [["name", "Test"], ["LIMIT", 1]]
INSERT INTO "animals" ("name", "gender", "species_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["gender", ""], ["species_id", 3], ["created_at", "2020-03-18 18:31:20.590235"], ["updated_at", "2020-03-18 18:31:20.590235"]]
---
	def create
		# We want to create a new animal & probably send that animal back as JSON

		species = Species.find_or_create_by(name: animal_params[:species].capitalize)
    animal = Animal.new(name: animal_params[:name], gender: animal_params[:gender], species: species)

    if animal.save