29-rails-api-intro/backend/app/controllers/species_controller.rb

	def index
		species = Species.all
---
SELECT "species".* FROM "species"

	def show
		single_species = Species.find(params[:id])
---
SELECT "species".* FROM "species" WHERE "species"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]